Repository: itquanghuy85/quanlyshop
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Repair Shop Management
vi: Quản lý tiệm sửa chữa

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

source: SETTINGS
vi: CÀI ĐẶT

source: Language
vi: Ngôn ngữ

source: Select Language
vi: Chọn ngôn ngữ

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: Change Language
vi: Đổi ngôn ngữ

source: Username
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

source: Forgot Password?
vi: Quên mật khẩu?

source: Sign In
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

source: Home
vi: Trang chủ

source: Orders
vi: Đơn hàng

source: INVENTORY
vi: KHO HÀNG

source: SUPPLIERS
vi: NHÀ CC

source: Parts
vi: Linh kiện

source: SALES
vi: BÁN HÀNG

source: CUSTOMERS
vi: KHÁCH HÀNG

source: DEBTS
vi: CÔNG NỢ

source: Save
vi: Lưu

source: CANCEL
vi: HỦY

source: Remember me
vi: Lưu tài khoản

# loginError
source: Invalid email or password
vi: Sai tài khoản hoặc mật khẩu

source: SHOP MANAGEMENT
vi: QUẢN LÝ SHOP

source: Store Icon
vi: Biểu tượng cửa hàng

source: Manage Staff
vi: Quản lý nhân viên

source: Create Invite Code
vi: Tạo mã mời

# shareQR
source: Share QR Code
vi: Chia sẻ mã QR

source: Staff List
vi: Danh sách nhân viên

# addEditDeleteStaff
source: Add/Edit/Delete Staff, Create Invite Code
vi: Thêm/Sửa/Xóa nhân viên, Tạo mã mời

source: Finance
vi: Tài chính

source: REVENUE
vi: DOANH THU

source: EXPENSES
vi: CHI PHÍ

source: REPAIR
vi: SỬA CHỮA

source: WARRANTY
vi: BẢO HÀNH

source: PRINTER
vi: MÁY IN

source: AUDIT LOG
vi: NHẬT KÝ

source: Performance
vi: HIỆU SUẤT

source: ATTENDANCE
vi: CHẤM CÔNG

source: PAYROLL
vi: LƯƠNG

source: Debt
vi: CÔNG NỢ

source: Quick Actions
vi: TRUY CẬP NHANH

source: Check Inventory
vi: KIỂM KHO

source: Manage Inventory
vi: QUẢN LÝ KHO

source: View & Print Labels
vi: Xem & In tem

# accountInfo
source: ACCOUNT INFORMATION
vi: THÔNG TIN TÀI KHOAN

# viewPermissions
source: View Permissions & Account Info
vi: Xem quyền và thông tin tài khoản

source: Sync Data
vi: Đồng bộ dữ liệu

# syncCompleted
source: Data sync completed
vi: ĐÃ ĐỒNG BỘ DỮ LIỆU

source: Sync error
vi: LỖI ĐỒNG BỘ

# accountInfoTitle
source: ACCOUNT INFO
vi: THÔNG TIN TÀI KHOAN

source: View Inventory
vi: Xem kho

source: Yes
vi: Có

source: No
vi: Không

source: CLOSE
vi: ĐÓNG

source: Other permissions
vi: Quyền khác

source: View Sales
vi: Bán hàng

source: View Repairs
vi: Sửa chữa

source: View Printer
vi: Máy in

source: View Revenue
vi: Doanh thu

source: View Expenses
vi: Chi phí

source: View Debts
vi: Công nợ

source: View Settings
vi: Cài đặt

source: Shop Locked
vi: Cửa hàng bị khóa

# shopLockedMessage
source: The shop has been temporarily locked by Super Admin. All functions are limited until unlocked.
vi: CỬA HÀNG ĐANG BỊ SUPER ADMIN KHÓA TẠM THỜI. Mọi chức năng đều bị giới hạn cho đến khi được mở lại.

source: Search customer by phone
vi: Tìm nhanh khách theo SĐT

source: Arrow Forward
vi: Mũi tên tiến

source: Perpetual Calendar
vi: Lịch vĩnh cửu

source: Quick Stats
vi: Thống kê nhanh

source: Pending Repairs
vi: Đang sửa

source: Completed Today
vi: Xong/Giao hôm nay

source: Sold Today
vi: Bán máy hôm nay

# todaySummary
source: TODAY'S WORK
vi: VIỆC HÔM NAY

source: New repairs today
vi: Máy nhận hôm nay

source: Sales today
vi: Đơn bán hôm nay

source: Expenses today
vi: Chi phí hôm nay

source: Outstanding debts
vi: Công nợ còn lại

source: Grid Menu
vi: Menu lưới

source: SELL
vi: BÁN HÀNG

source: REVENUE REPORT
vi: BÁO CÁO DT

source: PROFIT & LOSS
vi: LỢI NHUẬN

source: Net Profit
vi: LỢI NHUẬN RÒNG

source: Inventory Snapshot
vi: Kiểm kê hàng tồn

source: Total items
vi: Tổng món

source: Inventory value
vi: Giá trị tồn

source: No items in stock
vi: Chưa có hàng tồn

source: CLOSING CARD
vi: CHỐT QUỸ NGÀY

source: Cash Start
vi: Tiền mặt đầu ngày

source: Bank Start
vi: Ngân hàng đầu ngày

source: Cash End
vi: Tiền mặt cuối ngày

source: Bank End
vi: Ngân hàng cuối ngày

source: Note
vi: Ghi chú

source: Save Closing
vi: Lưu chốt quỹ

source: REVENUE DISTRIBUTION
vi: PHÂN BỔ DOANH THU

source: Sales Profit
vi: Lãi Bán máy

source: Repair Profit
vi: Lãi Sửa chữa

source: Total Expenses
vi: Tổng Chi phí

source: TOTAL PROFIT
vi: TỔNG LỢI NHUẬN

source: Period
vi: Khoảng thời gian

source: Today
vi: Hôm nay

source: This Week
vi: Tuần này

source: This Month
vi: Tháng này

source: This Year
vi: Năm nay

source: All Time
vi: Tất cả

source: Quick Action Button
vi: Nút hành động nhanh

source: Report Card
vi: Thẻ báo cáo

source: Summary Row
vi: Dòng tổng kết

# settingsTitle
source: SYSTEM SETTINGS
vi: CÀI ĐẶT HỆ THỐNG

# languageLabel
source: Language:
vi: Ngôn ngữ:

# brandInfoSection
source: BRAND INFORMATION
vi: THÔNG TIN THƯƠNG HIỆU

# shopNameLabel
source: Shop Name (UPPERCASE)
vi: Tên cửa hàng (IN HOA)

# shopPhoneLabel
source: Contact Phone Number
vi: Số điện thoại liên hệ

# shopAddressLabel
source: Shop Address
vi: Địa chỉ shop

# invoiceConfigSection
source: INVOICE CONFIGURATION
vi: CẤU HÌNH HÓA ĐƠN

# invoiceFooterLabel
source: Footer Message
vi: Lời chào chân trang

source: Create Invoice Template
vi: Tạo mẫu hóa đơn

# joinShopCode
source: Enter Invite Code to Join Shop
vi: Nhập mã mời tham gia shop

# cleanupManagement
source: Cleanup Management: Delete Old Repair Records (Optional)
vi: Quản lý cleanup: Xóa lịch sửa cũ (tùy chọn)

# aboutSection
source: ABOUT
vi: GIỚI THIỆU

# appDescription
source: Phone Repair Shop Management
vi: Quản lý cửa hàng sửa chữa điện thoại

source: Version
vi: Phiên bản

source: Contact Support
vi: Liên hệ hỗ trợ

source: Developer
vi: Người phát triển

# developerRole
source: Mobile App Development Expert
vi: Chuyên gia phát triển ứng dụng mobile

# contactPhone
source: Phone/Zalo: 0964 095 979
vi: SĐT/Zalo: 0964 095 979

# technicalSupport
source: Technical Support & App Development
vi: Hỗ trợ kỹ thuật & phát triển app

# businessSolutions
source: Business Management Solutions Development
vi: Phát triển giải pháp quản lý kinh doanh

source: SAVE ALL SETTINGS
vi: LƯU TOÀN BỘ CÀI ĐẶT

source: Enter Invite Code
vi: Nhập mã mời

# inviteCode8Chars
source: Invite Code (8 characters)
vi: Mã mời (8 ký tự)

source: Scan QR
vi: Quét QR

# codeMustBe8Chars
source: Code must be 8 characters
vi: Mã phải 8 ký tự

# joinedShopSuccessfully
source: Successfully joined shop!
vi: Đã tham gia shop thành công!

source: Invalid or expired code
vi: Mã không hợp lệ hoặc đã hết hạn

source: JOIN
vi: THAM GIA

# cleanupConfigOptIn
source: Cleanup Configuration (opt-in)
vi: Cấu hình Cleanup (opt-in)

source: Enable cleanup
vi: Bật cleanup

# daysToDeleteAfter
source: Number of days (delete after N days)
vi: Số ngày (xóa sau N ngày)

# noPermissionToConfigure
source: Account does not have permission to configure
vi: Tài khoản không có quyền cấu hình

# shopInfoSaved
source: SHOP INFORMATION SAVED!
vi: ĐÃ LƯU THÔNG TIN CỬA HÀNG!

# cleanupConfigSaved
source: Cleanup configuration saved
vi: Đã lưu cấu hình cleanup

source: Scan QR Code
vi: Quét mã QR

source: CREATE REPAIR ORDER
vi: TIẾP NHẬN MÁY MỚI

# noPermissionRepair
source: This account does not have permission to access REPAIR section. Contact shop owner to grant permission.
vi: Tài khoản này không được phép vào mục SỬA CHỮA. Liên hệ chủ shop để phân quyền.

source: Allowed
vi: Có

source: Not Allowed
vi: Không

source: Repair permission
vi: Quyền sửa chữa

source: Sales permission
vi: Quyền bán hàng

source: Inventory permission
vi: Quyền kho hàng

source: Suppliers permission
vi: Quyền nhà cung cấp

source: Customers permission
vi: Quyền khách hàng

source: Warranty permission
vi: Quyền bảo hành

source: Chat permission
vi: Quyền chat

source: Printer permission
vi: Quyền máy in

source: Revenue permission
vi: Quyền doanh thu

source: Expenses permission
vi: Quyền chi phí

source: Debts permission
vi: Quyền công nợ

# noPermissionRevenue
source: This account does not have permission to view REVENUE screen. Contact shop owner to grant permission.
vi: Tài khoản này không được phép xem màn DOANH THU. Liên hệ chủ shop để phân quyền.

# noPermissionRevenueReport
source: This account does not have permission to view REVENUE REPORT screen. Contact shop owner to grant permission.
vi: Tài khoản này không được phép xem màn BÁO CÁO DOANH THU. Liên hệ chủ shop để phân quyền.

# noPermissionSales
source: This account does not have permission to access SALES section. Contact shop owner to grant permission.
vi: Tài khoản này không được phép vào mục BÁN HÀNG. Liên hệ chủ shop để phân quyền.

# noPermissionInventory
source: This account does not have permission to access INVENTORY section. Contact shop owner to grant permission.
vi: Tài khoản này không được phép vào mục KHO MÁY. Liên hệ chủ shop để phân quyền.

# noPermissionCustomers
source: This account does not have permission to view CUSTOMER SYSTEM. Contact shop owner to grant permission.
vi: Tài khoản này không được phép xem HỆ THỐNG KHÁCH HÀNG. Liên hệ chủ shop để phân quyền.

# noPermissionWarranty
source: This account does not have permission to access WARRANTY section. Contact shop owner to grant permission.
vi: Tài khoản này không được phép vào mục BẢO HÀNH. Liên hệ chủ shop để phân quyền.

# noPermissionChat
source: This account does not have permission to use internal CHAT. Contact shop owner to grant permission.
vi: Tài khoản này không được phép sử dụng CHAT nội bộ. Liên hệ chủ shop để phân quyền.

# noPermissionPrinter
source: This account does not have permission to configure PRINTER. Contact shop owner to grant permission.
vi: Tài khoản này không được phép cấu hình MÁY IN. Liên hệ chủ shop để phân quyền.

# noPermissionCreateRepair
source: This account does not have permission to create repair receipt. Contact shop owner to grant permission.
vi: Tài khoản này không được phép tạo phiếu tiếp nhận. Liên hệ chủ shop để phân quyền.

source: View inventory permission
vi: Quyền xem kho

source: EMPLOYEE
vi: NHÂN VIÊN

source: INVENTORY CHECK
vi: KIỂM KHO

# checkInventoryDesc
source: Check phone and accessory stock
vi: Kiểm tra tồn kho điện thoại & phụ kiện

source: RECEIPT PRINTER
vi: MÁY IN HÓA ĐƠN

# printReceiptsDesc
source: Print invoices, receipts
vi: In hóa đơn, biên lai

source: REPAIR RECEIPT
vi: PHIẾU TIẾP NHẬN

# createRepairReceiptDesc
source: Create repair receipt
vi: Tạo phiếu nhận máy sửa chữa

source: THERMAL PRINTER
vi: MÁY IN NHIỆT

# printLabelsDesc
source: Print device information labels
vi: In tem thông tin máy

source: Quick Menu
vi: Menu nhanh

source: CUSTOMER NAME
vi: TÊN KHÁCH HÀNG

source: PHONE NUMBER
vi: SỐ ĐIỆN THOẠI

source: CUSTOMER ADDRESS
vi: ĐỊA CHỈ KHÁCH HÀNG

source: ADD TO CONTACTS
vi: THÊM VÀO DANH BẠ

source: VIEW CUSTOMER HISTORY
vi: XEM LỊCH SỬ KHÁCH NÀY

source: DEVICE MODEL
vi: MODEL MÁY

source: DEVICE ISSUE
vi: LỖI MÁY

source: APPEARANCE CONDITION
vi: TÌNH TRẠNG NGOẠI QUAN

# appearanceHint
source: Example: SCRATCHED, BROKEN, BENT...
vi: Ví dụ: TRẦY, BỂ, VÊNH...

source: ACCESSORIES INCLUDED
vi: PHỤ KIỆN ĐI KÈM

# accessoriesHint
source: Example: CHARGER, EARPHONES...
vi: Ví dụ: SẠC, TAI NGHE...

source: SCREEN PASSWORD
vi: MẬT KHẨU MÀN HÌNH

source: ESTIMATED PRICE
vi: GIÁ DỰ KIẾN

source: PAYMENT METHOD
vi: HÌNH THỨC THANH TOÁN

source: CASH
vi: TIỀN MẶT

source: BANK TRANSFER
vi: CHUYỂN KHOẢN

source: CREDIT
vi: CÔNG NỢ

# installment
source: INSTALLMENT (NH)
vi: TRẢ GÓP (NH)

# enterPhoneFirst
source: PLEASE ENTER PHONE NUMBER FIRST
vi: VUI LÒNG NHẬP SỐ ĐIỆN THOẠI TRƯỚC

# priceMustBePositive
source: PRICE MUST BE GREATER THAN OR EQUAL TO 0!
vi: GIÁ TIẾP NHẬN PHẢI LỚN HƠN HOẶC BẰNG 0!

source: CUSTOMER ADDED TO CONTACTS
vi: ĐÃ THÊM KHÁCH HÀNG VÀO DANH BẠ

source: NEW ORDER
vi: ĐƠN MỚI

source: RECEIVED DEVICE
vi: NHẬN

source: ADD PRODUCT TO INVENTORY
vi: NHẬP HÀNG VÀO KHO

source: PRODUCT TYPE
vi: Loại hàng

source: PHONE
vi: ĐIỆN THOẠI

source: ACCESSORY
vi: PHỤ KIỆN

source: PRODUCT NAME
vi: Tên máy/Linh kiện

# imeiNumber
source: IMEI NUMBER (IF ANY)
vi: Số IMEI (Nếu có)

source: COST PRICE
vi: Giá vốn

source: KPK PRICE
vi: Giá KPK

source: PK PRICE
vi: Giá PK

# capacity
source: CAPACITY (e.g. 64GB, 128GB)
vi: Dung lượng (ví dụ: 64GB, 128GB)

source: QUANTITY
vi: Số lượng

source: SUPPLIER (REQUIRED)
vi: Nhà cung cấp (bắt buộc)

source: ADD SUPPLIER QUICK
vi: Thêm NCC nhanh

source: ADD SUPPLIER
vi: THÊM NHÀ CUNG CẤP

# enterProductNameAndSupplier
source: PLEASE ENTER PRODUCT NAME AND SELECT SUPPLIER
vi: VUI LÒNG NHẬP TÊN HÀNG VÀ CHỌN NHÀ CUNG CẤP

source: PRODUCT ADDED TO INVENTORY
vi: ĐÃ NHẬP HÀNG VÀO KHO

source: DELETE MULTIPLE PRODUCTS
vi: XÓA NHIỀU SẢN PHẨM

# confirmDeleteSelectedProducts
source: Are you sure you want to delete {count} selected products from inventory?
vi: Bạn chắc chắn muốn xóa {count} sản phẩm đã chọn khỏi kho?

# productsDeleted
source: SELECTED PRODUCTS DELETED
vi: ĐÃ XÓA CÁC SẢN PHẨM ĐÃ CHỌN

# productDeleted
source: PRODUCT DELETED FROM INVENTORY
vi: ĐÃ XÓA SẢN PHẨM KHỎI KHO

# onlyAdminCanDelete
source: Only ADMIN accounts can delete products from inventory
vi: Chỉ tài khoản QUẢN LÝ mới được xóa hàng khỏi kho

source: SELECT PRINTER
vi: CHỌN MÁY IN

# noPrintersFound
source: No printers found. Please connect a printer first.
vi: Không tìm thấy máy in nào. Vui lòng kết nối máy in trước.

source: LABEL PRINTED SUCCESSFULLY
vi: ĐÃ IN TEM THÀNH CÔNG

# labelPrintFailed
source: LABEL PRINT FAILED - CHECK PRINTER
vi: IN TEM THẤT BẠI - KIỂM TRA MÁY IN

source: ERROR PRINTING LABEL
vi: LỖI KHI IN TEM

source: FINANCE CENTER
vi: TRUNG TÂM TÀI CHÍNH

source: REPAIRS
vi: SỬA CHỮA

source: STAFF
vi: NHÂN VIÊN

source: All
vi: Tất cả

# passwordHint
source: Password
vi: Mật khẩu

# priceHint
source: Price
vi: Giá

source: Transfer
vi: Chuyển

source: Save Repair Order
vi: Lưu đơn sửa chữa

# noPermissionSuppliers
source: This account is not allowed to view SUPPLIERS. Contact shop owner to grant permission.
vi: Tài khoản này không được phép xem NHÀ CUNG CẤP. Liên hệ chủ shop để phân quyền.

# selectedCount
source: {count} selected
vi: {count} đã chọn

source: Select all
vi: Chọn tất cả

source: Clear selection
vi: Bỏ chọn

# supplierShort
source: SUP
vi: NCC

# quantityShort
source: QTY
vi: SL

source: Print phone label
vi: In tem điện thoại

source: Delete from inventory
vi: Xóa khỏi kho

source: Delete selected
vi: Xóa đã chọn

source: Add new product
vi: Thêm sản phẩm mới

# modelRequired
source: Please enter device model
vi: Vui lòng nhập model máy

# issueRequired
source: Please enter device issue
vi: Vui lòng nhập lỗi máy

# orderCreatedSuccessfully
source: Repair order created successfully!
vi: Đã tạo đơn sửa chữa thành công!

# createNewOrderQuestion
source: Do you want to create a new repair order?
vi: Bạn có muốn tạo đơn sửa chữa mới không?

source: Back
vi: Quay lại

# saveOrderError
source: Error saving order: {error}
vi: Lỗi lưu đơn: {error}

source: Confirm print label
vi: Xác nhận in tem

source: Print label
vi: In tem

# confirmDeleteProduct
source: Are you sure you want to delete product '{name}' from inventory?
vi: Bạn chắc chắn muốn xóa sản phẩm '{name}' khỏi kho?

source: Delete product from inventory
vi: Xóa sản phẩm khỏi kho

source: Delete
vi: Xóa

source: PRODUCT DELETED FROM INVENTORY
vi: ĐÃ XÓA SẢN PHẨM KHỎI KHO

# confirmDeleteMultipleProducts
source: Are you sure you want to delete {count} selected products from inventory?
vi: Bạn chắc chắn muốn xóa {count} sản phẩm đã chọn khỏi kho?

# multipleProductsDeleted
source: {count} PRODUCTS DELETED
vi: ĐÃ XÓA {count} SẢN PHẨM

source: IMEI (Optional)
vi: IMEI (Tùy chọn)

# capacityExample
source: Capacity (e.g. 64GB, 128GB)
vi: Dung lượng (ví dụ: 64GB, 128GB)

source: Add supplier quickly
vi: Thêm NCC nhanh

source: Supplier name
vi: Tên nhà cung cấp

source: Contact person
vi: Người liên hệ

source: Address
vi: Địa chỉ

source: Name
vi: Tên

source: Color
vi: Màu

source: Price
vi: Giá

source: Condition
vi: Tình trạng

source: Accessories
vi: Phụ kiện

# labelPrintError
source: Label print error: {error}
vi: Lỗi in tem: {error}

source: CASH CLOSING SAVED
vi: ĐÃ LƯU CHỐT QUỸ NGÀY

source: NET PROFIT AFTER EXPENSES
vi: LỢI NHUẬN SAU CHI PHÍ

source: Time Period
vi: Khoảng thời gian

# todayCashFlow
source: TODAY'S CASH FLOW
vi: DÒNG TIỀN HÔM NAY

source: Save Cash Closing
vi: Lưu chốt quỹ
